espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/soc_etm_reg.h
/** SOC_ETM_CH_ENA_AD1_CLR_REG register
 *  Channel enable clear register
 */
#define SOC_ETM_CH_ENA_AD1_CLR_REG (DR_REG_SOC_ETM_BASE + 0x14)
/** SOC_ETM_CH_CLR32 : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear ch32 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR32    (BIT(0))
#define SOC_ETM_CH_CLR32_M  (SOC_ETM_CH_CLR32_V << SOC_ETM_CH_CLR32_S)
#define SOC_ETM_CH_CLR32_V  0x00000001U
#define SOC_ETM_CH_CLR32_S  0
/** SOC_ETM_CH_CLR33 : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear ch33 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR33    (BIT(1))
#define SOC_ETM_CH_CLR33_M  (SOC_ETM_CH_CLR33_V << SOC_ETM_CH_CLR33_S)
#define SOC_ETM_CH_CLR33_V  0x00000001U
#define SOC_ETM_CH_CLR33_S  1
/** SOC_ETM_CH_CLR34 : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear ch34 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR34    (BIT(2))
#define SOC_ETM_CH_CLR34_M  (SOC_ETM_CH_CLR34_V << SOC_ETM_CH_CLR34_S)
#define SOC_ETM_CH_CLR34_V  0x00000001U
#define SOC_ETM_CH_CLR34_S  2
/** SOC_ETM_CH_CLR35 : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear ch35 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR35    (BIT(3))
#define SOC_ETM_CH_CLR35_M  (SOC_ETM_CH_CLR35_V << SOC_ETM_CH_CLR35_S)
#define SOC_ETM_CH_CLR35_V  0x00000001U
#define SOC_ETM_CH_CLR35_S  3
/** SOC_ETM_CH_CLR36 : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear ch36 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR36    (BIT(4))
#define SOC_ETM_CH_CLR36_M  (SOC_ETM_CH_CLR36_V << SOC_ETM_CH_CLR36_S)
#define SOC_ETM_CH_CLR36_V  0x00000001U
#define SOC_ETM_CH_CLR36_S  4
/** SOC_ETM_CH_CLR37 : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear ch37 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR37    (BIT(5))
#define SOC_ETM_CH_CLR37_M  (SOC_ETM_CH_CLR37_V << SOC_ETM_CH_CLR37_S)
#define SOC_ETM_CH_CLR37_V  0x00000001U
#define SOC_ETM_CH_CLR37_S  5
/** SOC_ETM_CH_CLR38 : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear ch38 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR38    (BIT(6))
#define SOC_ETM_CH_CLR38_M  (SOC_ETM_CH_CLR38_V << SOC_ETM_CH_CLR38_S)
#define SOC_ETM_CH_CLR38_V  0x00000001U
#define SOC_ETM_CH_CLR38_S  6
/** SOC_ETM_CH_CLR39 : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear ch39 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR39    (BIT(7))
#define SOC_ETM_CH_CLR39_M  (SOC_ETM_CH_CLR39_V << SOC_ETM_CH_CLR39_S)
#define SOC_ETM_CH_CLR39_V  0x00000001U
#define SOC_ETM_CH_CLR39_S  7
/** SOC_ETM_CH_CLR40 : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear ch40 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR40    (BIT(8))
#define SOC_ETM_CH_CLR40_M  (SOC_ETM_CH_CLR40_V << SOC_ETM_CH_CLR40_S)
#define SOC_ETM_CH_CLR40_V  0x00000001U
#define SOC_ETM_CH_CLR40_S  8
/** SOC_ETM_CH_CLR41 : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear ch41 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR41    (BIT(9))
#define SOC_ETM_CH_CLR41_M  (SOC_ETM_CH_CLR41_V << SOC_ETM_CH_CLR41_S)
#define SOC_ETM_CH_CLR41_V  0x00000001U
#define SOC_ETM_CH_CLR41_S  9
/** SOC_ETM_CH_CLR42 : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear ch42 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR42    (BIT(10))
#define SOC_ETM_CH_CLR42_M  (SOC_ETM_CH_CLR42_V << SOC_ETM_CH_CLR42_S)
#define SOC_ETM_CH_CLR42_V  0x00000001U
#define SOC_ETM_CH_CLR42_S  10
/** SOC_ETM_CH_CLR43 : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear ch43 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR43    (BIT(11))
#define SOC_ETM_CH_CLR43_M  (SOC_ETM_CH_CLR43_V << SOC_ETM_CH_CLR43_S)
#define SOC_ETM_CH_CLR43_V  0x00000001U
#define SOC_ETM_CH_CLR43_S  11
/** SOC_ETM_CH_CLR44 : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear ch44 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR44    (BIT(12))
#define SOC_ETM_CH_CLR44_M  (SOC_ETM_CH_CLR44_V << SOC_ETM_CH_CLR44_S)
#define SOC_ETM_CH_CLR44_V  0x00000001U
#define SOC_ETM_CH_CLR44_S  12
/** SOC_ETM_CH_CLR45 : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear ch45 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR45    (BIT(13))
#define SOC_ETM_CH_CLR45_M  (SOC_ETM_CH_CLR45_V << SOC_ETM_CH_CLR45_S)
#define SOC_ETM_CH_CLR45_V  0x00000001U
#define SOC_ETM_CH_CLR45_S  13
/** SOC_ETM_CH_CLR46 : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear ch46 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR46    (BIT(14))
#define SOC_ETM_CH_CLR46_M  (SOC_ETM_CH_CLR46_V << SOC_ETM_CH_CLR46_S)
#define SOC_ETM_CH_CLR46_V  0x00000001U
#define SOC_ETM_CH_CLR46_S  14
/** SOC_ETM_CH_CLR47 : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear ch47 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR47    (BIT(15))
#define SOC_ETM_CH_CLR47_M  (SOC_ETM_CH_CLR47_V << SOC_ETM_CH_CLR47_S)
#define SOC_ETM_CH_CLR47_V  0x00000001U
#define SOC_ETM_CH_CLR47_S  15
/** SOC_ETM_CH_CLR48 : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear ch48 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR48    (BIT(16))
#define SOC_ETM_CH_CLR48_M  (SOC_ETM_CH_CLR48_V << SOC_ETM_CH_CLR48_S)
#define SOC_ETM_CH_CLR48_V  0x00000001U
#define SOC_ETM_CH_CLR48_S  16
/** SOC_ETM_CH_CLR49 : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear ch49 enable.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CH_CLR49    (BIT(17))
#define SOC_ETM_CH_CLR49_M  (SOC_ETM_CH_CLR49_V << SOC_ETM_CH_CLR49_S)
#define SOC_ETM_CH_CLR49_V  0x00000001U
#define SOC_ETM_CH_CLR49_S  17

/** SOC_ETM_CH0_EVT_ID_REG register
 *  Channel0 event id register
 */
#define SOC_ETM_CH0_EVT_ID_REG (DR_REG_SOC_ETM_BASE + 0x18)
/** SOC_ETM_CH0_EVT_ID : R/W; bitpos: [7:0]; default: 0;
 *  Configures ch0_evt_id
 */
#define SOC_ETM_CH0_EVT_ID    0x000000FFU
#define SOC_ETM_CH0_EVT_ID_M  (SOC_ETM_CH0_EVT_ID_V << SOC_ETM_CH0_EVT_ID_S)
#define SOC_ETM_CH0_EVT_ID_V  0x000000FFU
#define SOC_ETM_CH0_EVT_ID_S  0

/** SOC_ETM_CH0_TASK_ID_REG register
 *  Channel0 task id register
 */
#define SOC_ETM_CH0_TASK_ID_REG (DR_REG_SOC_ETM_BASE + 0x1c)
/** SOC_ETM_CH0_TASK_ID : R/W; bitpos: [7:0]; default: 0;
 *  Configures ch0_task_id
 */
#define SOC_ETM_CH0_TASK_ID    0x000000FFU
#define SOC_ETM_CH0_TASK_ID_M  (SOC_ETM_CH0_TASK_ID_V << SOC_ETM_CH0_TASK_ID_S)
#define SOC_ETM_CH0_TASK_ID_V  0x000000FFU
#define SOC_ETM_CH0_TASK_ID_S  0

/** SOC_ETM_CH1_EVT_ID_REG register
 *  Channel1 event id register
 */
#define SOC_ETM_CH1_EVT_ID_REG (DR_REG_SOC_ETM_BASE + 0x20)
/** SOC_ETM_CH1_EVT_ID : R/W; bitpos: [7:0]; default: 0;
 *  Configures ch1_evt_id
 */
#define SOC_ETM_CH1_EVT_ID    0x000000FFU
#define SOC_ETM_CH1_EVT_ID_M  (SOC_ETM_CH1_EVT_ID_V << SOC_ETM_CH1_EVT_ID_S)
#define SOC_ETM_CH1_EVT_ID_V  0x000000FFU
#define SOC_ETM_CH1_EVT_ID_S  0

/** SOC_ETM_CH1_TASK_ID_REG register
 *  Channel1 task id register
 */
#define SOC_ETM_CH1_TASK_ID_REG (DR_REG_SOC_ETM_BASE + 0x24)
/** SOC_ETM_CH1_TASK_ID : R/W; bitpos: [7:0]; default: 0;
 *  Configures ch1_task_id
 */
#define SOC_ETM_CH1_TASK_ID    0x000000FFU
#define SOC_ETM_CH1_TASK_ID_M  (SOC_ETM_CH1_TASK_ID_V << SOC_ETM_CH1_TASK_ID_S)
#define SOC_ETM_CH1_TASK_ID_V  0x000000FFU
#define SOC_ETM_CH1_TASK_ID_S  0

