espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST3_REG register
 *  Events trigger status register
 */
#define SOC_ETM_EVT_ST3_REG (DR_REG_SOC_ETM_BASE + 0x1c0)
/** SOC_ETM_MCPWM1_EVT_TIMER1_STOP_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents MCPWM1_evt_timer1_stop trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER1_STOP_ST    (BIT(0))
#define SOC_ETM_MCPWM1_EVT_TIMER1_STOP_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER1_STOP_ST_V << SOC_ETM_MCPWM1_EVT_TIMER1_STOP_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER1_STOP_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER1_STOP_ST_S  0
/** SOC_ETM_MCPWM1_EVT_TIMER2_STOP_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents MCPWM1_evt_timer2_stop trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER2_STOP_ST    (BIT(1))
#define SOC_ETM_MCPWM1_EVT_TIMER2_STOP_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER2_STOP_ST_V << SOC_ETM_MCPWM1_EVT_TIMER2_STOP_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER2_STOP_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER2_STOP_ST_S  1
/** SOC_ETM_MCPWM1_EVT_TIMER0_TEZ_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents MCPWM1_evt_timer0_tez trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEZ_ST    (BIT(2))
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEZ_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER0_TEZ_ST_V << SOC_ETM_MCPWM1_EVT_TIMER0_TEZ_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEZ_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEZ_ST_S  2
/** SOC_ETM_MCPWM1_EVT_TIMER1_TEZ_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents MCPWM1_evt_timer1_tez trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEZ_ST    (BIT(3))
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEZ_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER1_TEZ_ST_V << SOC_ETM_MCPWM1_EVT_TIMER1_TEZ_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEZ_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEZ_ST_S  3
/** SOC_ETM_MCPWM1_EVT_TIMER2_TEZ_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents MCPWM1_evt_timer2_tez trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEZ_ST    (BIT(4))
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEZ_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER2_TEZ_ST_V << SOC_ETM_MCPWM1_EVT_TIMER2_TEZ_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEZ_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEZ_ST_S  4
/** SOC_ETM_MCPWM1_EVT_TIMER0_TEP_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents MCPWM1_evt_timer0_tep trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEP_ST    (BIT(5))
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEP_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER0_TEP_ST_V << SOC_ETM_MCPWM1_EVT_TIMER0_TEP_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEP_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER0_TEP_ST_S  5
/** SOC_ETM_MCPWM1_EVT_TIMER1_TEP_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents MCPWM1_evt_timer1_tep trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEP_ST    (BIT(6))
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEP_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER1_TEP_ST_V << SOC_ETM_MCPWM1_EVT_TIMER1_TEP_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEP_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER1_TEP_ST_S  6
/** SOC_ETM_MCPWM1_EVT_TIMER2_TEP_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents MCPWM1_evt_timer2_tep trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEP_ST    (BIT(7))
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEP_ST_M  (SOC_ETM_MCPWM1_EVT_TIMER2_TEP_ST_V << SOC_ETM_MCPWM1_EVT_TIMER2_TEP_ST_S)
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEP_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TIMER2_TEP_ST_S  7
/** SOC_ETM_MCPWM1_EVT_OP0_TEA_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents MCPWM1_evt_op0_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP0_TEA_ST    (BIT(8))
#define SOC_ETM_MCPWM1_EVT_OP0_TEA_ST_M  (SOC_ETM_MCPWM1_EVT_OP0_TEA_ST_V << SOC_ETM_MCPWM1_EVT_OP0_TEA_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP0_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP0_TEA_ST_S  8
/** SOC_ETM_MCPWM1_EVT_OP1_TEA_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents MCPWM1_evt_op1_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP1_TEA_ST    (BIT(9))
#define SOC_ETM_MCPWM1_EVT_OP1_TEA_ST_M  (SOC_ETM_MCPWM1_EVT_OP1_TEA_ST_V << SOC_ETM_MCPWM1_EVT_OP1_TEA_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP1_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP1_TEA_ST_S  9
/** SOC_ETM_MCPWM1_EVT_OP2_TEA_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents MCPWM1_evt_op2_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP2_TEA_ST    (BIT(10))
#define SOC_ETM_MCPWM1_EVT_OP2_TEA_ST_M  (SOC_ETM_MCPWM1_EVT_OP2_TEA_ST_V << SOC_ETM_MCPWM1_EVT_OP2_TEA_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP2_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP2_TEA_ST_S  10
/** SOC_ETM_MCPWM1_EVT_OP0_TEB_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents MCPWM1_evt_op0_teb trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP0_TEB_ST    (BIT(11))
#define SOC_ETM_MCPWM1_EVT_OP0_TEB_ST_M  (SOC_ETM_MCPWM1_EVT_OP0_TEB_ST_V << SOC_ETM_MCPWM1_EVT_OP0_TEB_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP0_TEB_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP0_TEB_ST_S  11
/** SOC_ETM_MCPWM1_EVT_OP1_TEB_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents MCPWM1_evt_op1_teb trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP1_TEB_ST    (BIT(12))
#define SOC_ETM_MCPWM1_EVT_OP1_TEB_ST_M  (SOC_ETM_MCPWM1_EVT_OP1_TEB_ST_V << SOC_ETM_MCPWM1_EVT_OP1_TEB_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP1_TEB_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP1_TEB_ST_S  12
/** SOC_ETM_MCPWM1_EVT_OP2_TEB_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents MCPWM1_evt_op2_teb trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP2_TEB_ST    (BIT(13))
#define SOC_ETM_MCPWM1_EVT_OP2_TEB_ST_M  (SOC_ETM_MCPWM1_EVT_OP2_TEB_ST_V << SOC_ETM_MCPWM1_EVT_OP2_TEB_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP2_TEB_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP2_TEB_ST_S  13
/** SOC_ETM_MCPWM1_EVT_F0_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents MCPWM1_evt_f0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_F0_ST    (BIT(14))
#define SOC_ETM_MCPWM1_EVT_F0_ST_M  (SOC_ETM_MCPWM1_EVT_F0_ST_V << SOC_ETM_MCPWM1_EVT_F0_ST_S)
#define SOC_ETM_MCPWM1_EVT_F0_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_F0_ST_S  14
/** SOC_ETM_MCPWM1_EVT_F1_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents MCPWM1_evt_f1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_F1_ST    (BIT(15))
#define SOC_ETM_MCPWM1_EVT_F1_ST_M  (SOC_ETM_MCPWM1_EVT_F1_ST_V << SOC_ETM_MCPWM1_EVT_F1_ST_S)
#define SOC_ETM_MCPWM1_EVT_F1_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_F1_ST_S  15
/** SOC_ETM_MCPWM1_EVT_F2_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents MCPWM1_evt_f2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_F2_ST    (BIT(16))
#define SOC_ETM_MCPWM1_EVT_F2_ST_M  (SOC_ETM_MCPWM1_EVT_F2_ST_V << SOC_ETM_MCPWM1_EVT_F2_ST_S)
#define SOC_ETM_MCPWM1_EVT_F2_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_F2_ST_S  16
/** SOC_ETM_MCPWM1_EVT_F0_CLR_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents MCPWM1_evt_f0_clr trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_F0_CLR_ST    (BIT(17))
#define SOC_ETM_MCPWM1_EVT_F0_CLR_ST_M  (SOC_ETM_MCPWM1_EVT_F0_CLR_ST_V << SOC_ETM_MCPWM1_EVT_F0_CLR_ST_S)
#define SOC_ETM_MCPWM1_EVT_F0_CLR_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_F0_CLR_ST_S  17
/** SOC_ETM_MCPWM1_EVT_F1_CLR_ST : R/WTC/SS; bitpos: [18]; default: 0;
 *  Represents MCPWM1_evt_f1_clr trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_F1_CLR_ST    (BIT(18))
#define SOC_ETM_MCPWM1_EVT_F1_CLR_ST_M  (SOC_ETM_MCPWM1_EVT_F1_CLR_ST_V << SOC_ETM_MCPWM1_EVT_F1_CLR_ST_S)
#define SOC_ETM_MCPWM1_EVT_F1_CLR_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_F1_CLR_ST_S  18
/** SOC_ETM_MCPWM1_EVT_F2_CLR_ST : R/WTC/SS; bitpos: [19]; default: 0;
 *  Represents MCPWM1_evt_f2_clr trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_F2_CLR_ST    (BIT(19))
#define SOC_ETM_MCPWM1_EVT_F2_CLR_ST_M  (SOC_ETM_MCPWM1_EVT_F2_CLR_ST_V << SOC_ETM_MCPWM1_EVT_F2_CLR_ST_S)
#define SOC_ETM_MCPWM1_EVT_F2_CLR_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_F2_CLR_ST_S  19
/** SOC_ETM_MCPWM1_EVT_TZ0_CBC_ST : R/WTC/SS; bitpos: [20]; default: 0;
 *  Represents MCPWM1_evt_tz0_cbc trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TZ0_CBC_ST    (BIT(20))
#define SOC_ETM_MCPWM1_EVT_TZ0_CBC_ST_M  (SOC_ETM_MCPWM1_EVT_TZ0_CBC_ST_V << SOC_ETM_MCPWM1_EVT_TZ0_CBC_ST_S)
#define SOC_ETM_MCPWM1_EVT_TZ0_CBC_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TZ0_CBC_ST_S  20
/** SOC_ETM_MCPWM1_EVT_TZ1_CBC_ST : R/WTC/SS; bitpos: [21]; default: 0;
 *  Represents MCPWM1_evt_tz1_cbc trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TZ1_CBC_ST    (BIT(21))
#define SOC_ETM_MCPWM1_EVT_TZ1_CBC_ST_M  (SOC_ETM_MCPWM1_EVT_TZ1_CBC_ST_V << SOC_ETM_MCPWM1_EVT_TZ1_CBC_ST_S)
#define SOC_ETM_MCPWM1_EVT_TZ1_CBC_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TZ1_CBC_ST_S  21
/** SOC_ETM_MCPWM1_EVT_TZ2_CBC_ST : R/WTC/SS; bitpos: [22]; default: 0;
 *  Represents MCPWM1_evt_tz2_cbc trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TZ2_CBC_ST    (BIT(22))
#define SOC_ETM_MCPWM1_EVT_TZ2_CBC_ST_M  (SOC_ETM_MCPWM1_EVT_TZ2_CBC_ST_V << SOC_ETM_MCPWM1_EVT_TZ2_CBC_ST_S)
#define SOC_ETM_MCPWM1_EVT_TZ2_CBC_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TZ2_CBC_ST_S  22
/** SOC_ETM_MCPWM1_EVT_TZ0_OST_ST : R/WTC/SS; bitpos: [23]; default: 0;
 *  Represents MCPWM1_evt_tz0_ost trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TZ0_OST_ST    (BIT(23))
#define SOC_ETM_MCPWM1_EVT_TZ0_OST_ST_M  (SOC_ETM_MCPWM1_EVT_TZ0_OST_ST_V << SOC_ETM_MCPWM1_EVT_TZ0_OST_ST_S)
#define SOC_ETM_MCPWM1_EVT_TZ0_OST_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TZ0_OST_ST_S  23
/** SOC_ETM_MCPWM1_EVT_TZ1_OST_ST : R/WTC/SS; bitpos: [24]; default: 0;
 *  Represents MCPWM1_evt_tz1_ost trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TZ1_OST_ST    (BIT(24))
#define SOC_ETM_MCPWM1_EVT_TZ1_OST_ST_M  (SOC_ETM_MCPWM1_EVT_TZ1_OST_ST_V << SOC_ETM_MCPWM1_EVT_TZ1_OST_ST_S)
#define SOC_ETM_MCPWM1_EVT_TZ1_OST_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TZ1_OST_ST_S  24
/** SOC_ETM_MCPWM1_EVT_TZ2_OST_ST : R/WTC/SS; bitpos: [25]; default: 0;
 *  Represents MCPWM1_evt_tz2_ost trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_TZ2_OST_ST    (BIT(25))
#define SOC_ETM_MCPWM1_EVT_TZ2_OST_ST_M  (SOC_ETM_MCPWM1_EVT_TZ2_OST_ST_V << SOC_ETM_MCPWM1_EVT_TZ2_OST_ST_S)
#define SOC_ETM_MCPWM1_EVT_TZ2_OST_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_TZ2_OST_ST_S  25
/** SOC_ETM_MCPWM1_EVT_CAP0_ST : R/WTC/SS; bitpos: [26]; default: 0;
 *  Represents MCPWM1_evt_cap0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_CAP0_ST    (BIT(26))
#define SOC_ETM_MCPWM1_EVT_CAP0_ST_M  (SOC_ETM_MCPWM1_EVT_CAP0_ST_V << SOC_ETM_MCPWM1_EVT_CAP0_ST_S)
#define SOC_ETM_MCPWM1_EVT_CAP0_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_CAP0_ST_S  26
/** SOC_ETM_MCPWM1_EVT_CAP1_ST : R/WTC/SS; bitpos: [27]; default: 0;
 *  Represents MCPWM1_evt_cap1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_CAP1_ST    (BIT(27))
#define SOC_ETM_MCPWM1_EVT_CAP1_ST_M  (SOC_ETM_MCPWM1_EVT_CAP1_ST_V << SOC_ETM_MCPWM1_EVT_CAP1_ST_S)
#define SOC_ETM_MCPWM1_EVT_CAP1_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_CAP1_ST_S  27
/** SOC_ETM_MCPWM1_EVT_CAP2_ST : R/WTC/SS; bitpos: [28]; default: 0;
 *  Represents MCPWM1_evt_cap2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_CAP2_ST    (BIT(28))
#define SOC_ETM_MCPWM1_EVT_CAP2_ST_M  (SOC_ETM_MCPWM1_EVT_CAP2_ST_V << SOC_ETM_MCPWM1_EVT_CAP2_ST_S)
#define SOC_ETM_MCPWM1_EVT_CAP2_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_CAP2_ST_S  28
/** SOC_ETM_MCPWM1_EVT_OP0_TEE1_ST : R/WTC/SS; bitpos: [29]; default: 0;
 *  Represents MCPWM1_evt_op0_tee1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP0_TEE1_ST    (BIT(29))
#define SOC_ETM_MCPWM1_EVT_OP0_TEE1_ST_M  (SOC_ETM_MCPWM1_EVT_OP0_TEE1_ST_V << SOC_ETM_MCPWM1_EVT_OP0_TEE1_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP0_TEE1_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP0_TEE1_ST_S  29
/** SOC_ETM_MCPWM1_EVT_OP1_TEE1_ST : R/WTC/SS; bitpos: [30]; default: 0;
 *  Represents MCPWM1_evt_op1_tee1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP1_TEE1_ST    (BIT(30))
#define SOC_ETM_MCPWM1_EVT_OP1_TEE1_ST_M  (SOC_ETM_MCPWM1_EVT_OP1_TEE1_ST_V << SOC_ETM_MCPWM1_EVT_OP1_TEE1_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP1_TEE1_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP1_TEE1_ST_S  30
/** SOC_ETM_MCPWM1_EVT_OP2_TEE1_ST : R/WTC/SS; bitpos: [31]; default: 0;
 *  Represents MCPWM1_evt_op2_tee1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM1_EVT_OP2_TEE1_ST    (BIT(31))
#define SOC_ETM_MCPWM1_EVT_OP2_TEE1_ST_M  (SOC_ETM_MCPWM1_EVT_OP2_TEE1_ST_V << SOC_ETM_MCPWM1_EVT_OP2_TEE1_ST_S)
#define SOC_ETM_MCPWM1_EVT_OP2_TEE1_ST_V  0x00000001U
#define SOC_ETM_MCPWM1_EVT_OP2_TEE1_ST_S  31

