espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST6_CLR_REG register
 *  Events trigger status clear register
 */
#define SOC_ETM_EVT_ST6_CLR_REG (DR_REG_SOC_ETM_BASE + 0x1dc)
/** SOC_ETM_PDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_out_fifo_full_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR    (BIT(0))
#define SOC_ETM_PDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_OUT_FIFO_FULL_CH2_ST_CLR_S  0
/** SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH0_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH0_ST_CLR    (BIT(1))
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH0_ST_CLR_S  1
/** SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH1_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH1_ST_CLR    (BIT(2))
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH1_ST_CLR_S  2
/** SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH2_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_done_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH2_ST_CLR    (BIT(3))
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_DONE_CH2_ST_CLR_S  3
/** SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH0_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_suc_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH0_ST_CLR    (BIT(4))
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH0_ST_CLR_S  4
/** SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH1_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_suc_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH1_ST_CLR    (BIT(5))
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH1_ST_CLR_S  5
/** SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH2_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_suc_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH2_ST_CLR    (BIT(6))
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_SUC_EOF_CH2_ST_CLR_S  6
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH0_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_empty_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH0_ST_CLR    (BIT(7))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH0_ST_CLR_S  7
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH1_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_empty_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH1_ST_CLR    (BIT(8))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH1_ST_CLR_S  8
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH2_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_empty_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH2_ST_CLR    (BIT(9))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_EMPTY_CH2_ST_CLR_S  9
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH0_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_full_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH0_ST_CLR    (BIT(10))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH0_ST_CLR_S  10
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_full_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR    (BIT(11))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_S  11
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_full_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR    (BIT(12))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_S  12
/** SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR    (BIT(13))
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_S  13
/** SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR    (BIT(14))
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_S  14
/** SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_done_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR    (BIT(15))
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_S  15
/** SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR    (BIT(16))
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_S  16
/** SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR    (BIT(17))
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_S  17
/** SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR    (BIT(18))
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_S  18
/** SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR    (BIT(19))
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S  19
/** SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR    (BIT(20))
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_S  20
/** SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR    (BIT(21))
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_S  21
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR    (BIT(22))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_S  22
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR    (BIT(23))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_S  23
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR    (BIT(24))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_S  24
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR    (BIT(25))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_S  25
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR    (BIT(26))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_S  26
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR    (BIT(27))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_S  27
/** SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear PMU_evt_sleep_weekup trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR    (BIT(28))
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_M  (SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_V << SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_S)
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_V  0x00000001U
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_S  28
/** SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR    (BIT(29))
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_S  29
/** SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR    (BIT(30))
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_S  30
/** SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_suc_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR    (BIT(31))
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_S  31

