espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST7_REG register
 *  Events trigger status register
 */
#define SOC_ETM_EVT_ST7_REG (DR_REG_SOC_ETM_BASE + 0x1e0)
/** SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents DMA2D_evt_in_suc_eof_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST    (BIT(0))
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_M  (SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_V << SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_S)
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_S  0
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents DMA2D_evt_out_done_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST    (BIT(1))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_S  1
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents DMA2D_evt_out_done_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST    (BIT(2))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_S  2
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents DMA2D_evt_out_done_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST    (BIT(3))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_S  3
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents DMA2D_evt_out_eof_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST    (BIT(4))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_S  4
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents DMA2D_evt_out_eof_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST    (BIT(5))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_S  5
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents DMA2D_evt_out_eof_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST    (BIT(6))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_S  6
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents DMA2D_evt_out_total_eof_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST    (BIT(7))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_S  7
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents DMA2D_evt_out_total_eof_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST    (BIT(8))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_S  8
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents DMA2D_evt_out_total_eof_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST    (BIT(9))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_S  9

/** SOC_ETM_EVT_ST7_CLR_REG register
 *  Events trigger status clear register
 */
#define SOC_ETM_EVT_ST7_CLR_REG (DR_REG_SOC_ETM_BASE + 0x1e4)
/** SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_suc_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR    (BIT(0))
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_S  0
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR    (BIT(1))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_S  1
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR    (BIT(2))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_S  2
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_done_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR    (BIT(3))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_S  3
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR    (BIT(4))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_S  4
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR    (BIT(5))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_S  5
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR    (BIT(6))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_S  6
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_total_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR    (BIT(7))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S  7
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_total_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR    (BIT(8))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_S  8
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_total_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR    (BIT(9))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_S  9

