espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST5_CLR_REG register
 *  Tasks trigger status clear register
 */
#define SOC_ETM_TASK_ST5_CLR_REG (DR_REG_SOC_ETM_BASE + 0x214)
/** SOC_ETM_REGDMA_TASK_START0_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR    (BIT(0))
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START0_ST_CLR_V << SOC_ETM_REGDMA_TASK_START0_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START0_ST_CLR_S  0
/** SOC_ETM_REGDMA_TASK_START1_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR    (BIT(1))
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START1_ST_CLR_V << SOC_ETM_REGDMA_TASK_START1_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START1_ST_CLR_S  1
/** SOC_ETM_REGDMA_TASK_START2_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR    (BIT(2))
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START2_ST_CLR_V << SOC_ETM_REGDMA_TASK_START2_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START2_ST_CLR_S  2
/** SOC_ETM_REGDMA_TASK_START3_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear REGDMA_task_start3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR    (BIT(3))
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR_M  (SOC_ETM_REGDMA_TASK_START3_ST_CLR_V << SOC_ETM_REGDMA_TASK_START3_ST_CLR_S)
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START3_ST_CLR_S  3
/** SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear TMPSNSR_task_start_sample trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR    (BIT(4))
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_M  (SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_V << SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_S)
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_V  0x00000001U
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_CLR_S  4
/** SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear TMPSNSR_task_stop_sample trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR    (BIT(5))
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_M  (SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_V << SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_S)
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_V  0x00000001U
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_CLR_S  5
/** SOC_ETM_I2S0_TASK_START_RX_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear I2S0_task_start_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR    (BIT(6))
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR_M  (SOC_ETM_I2S0_TASK_START_RX_ST_CLR_V << SOC_ETM_I2S0_TASK_START_RX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_START_RX_ST_CLR_S  6
/** SOC_ETM_I2S0_TASK_START_TX_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear I2S0_task_start_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR    (BIT(7))
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR_M  (SOC_ETM_I2S0_TASK_START_TX_ST_CLR_V << SOC_ETM_I2S0_TASK_START_TX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_START_TX_ST_CLR_S  7
/** SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear I2S0_task_stop_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR    (BIT(8))
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_M  (SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_V << SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_CLR_S  8
/** SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear I2S0_task_stop_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR    (BIT(9))
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_M  (SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_V << SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_S)
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_CLR_S  9
/** SOC_ETM_I2S1_TASK_START_RX_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear I2S1_task_start_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_TASK_START_RX_ST_CLR    (BIT(10))
#define SOC_ETM_I2S1_TASK_START_RX_ST_CLR_M  (SOC_ETM_I2S1_TASK_START_RX_ST_CLR_V << SOC_ETM_I2S1_TASK_START_RX_ST_CLR_S)
#define SOC_ETM_I2S1_TASK_START_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_TASK_START_RX_ST_CLR_S  10
/** SOC_ETM_I2S1_TASK_START_TX_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear I2S1_task_start_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_TASK_START_TX_ST_CLR    (BIT(11))
#define SOC_ETM_I2S1_TASK_START_TX_ST_CLR_M  (SOC_ETM_I2S1_TASK_START_TX_ST_CLR_V << SOC_ETM_I2S1_TASK_START_TX_ST_CLR_S)
#define SOC_ETM_I2S1_TASK_START_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_TASK_START_TX_ST_CLR_S  11
/** SOC_ETM_I2S1_TASK_STOP_RX_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear I2S1_task_stop_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_TASK_STOP_RX_ST_CLR    (BIT(12))
#define SOC_ETM_I2S1_TASK_STOP_RX_ST_CLR_M  (SOC_ETM_I2S1_TASK_STOP_RX_ST_CLR_V << SOC_ETM_I2S1_TASK_STOP_RX_ST_CLR_S)
#define SOC_ETM_I2S1_TASK_STOP_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_TASK_STOP_RX_ST_CLR_S  12
/** SOC_ETM_I2S1_TASK_STOP_TX_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear I2S1_task_stop_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_TASK_STOP_TX_ST_CLR    (BIT(13))
#define SOC_ETM_I2S1_TASK_STOP_TX_ST_CLR_M  (SOC_ETM_I2S1_TASK_STOP_TX_ST_CLR_V << SOC_ETM_I2S1_TASK_STOP_TX_ST_CLR_S)
#define SOC_ETM_I2S1_TASK_STOP_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_TASK_STOP_TX_ST_CLR_S  13
/** SOC_ETM_I2S2_TASK_START_RX_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear I2S2_task_start_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S2_TASK_START_RX_ST_CLR    (BIT(14))
#define SOC_ETM_I2S2_TASK_START_RX_ST_CLR_M  (SOC_ETM_I2S2_TASK_START_RX_ST_CLR_V << SOC_ETM_I2S2_TASK_START_RX_ST_CLR_S)
#define SOC_ETM_I2S2_TASK_START_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S2_TASK_START_RX_ST_CLR_S  14
/** SOC_ETM_I2S2_TASK_START_TX_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear I2S2_task_start_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S2_TASK_START_TX_ST_CLR    (BIT(15))
#define SOC_ETM_I2S2_TASK_START_TX_ST_CLR_M  (SOC_ETM_I2S2_TASK_START_TX_ST_CLR_V << SOC_ETM_I2S2_TASK_START_TX_ST_CLR_S)
#define SOC_ETM_I2S2_TASK_START_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S2_TASK_START_TX_ST_CLR_S  15
/** SOC_ETM_I2S2_TASK_STOP_RX_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear I2S2_task_stop_rx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S2_TASK_STOP_RX_ST_CLR    (BIT(16))
#define SOC_ETM_I2S2_TASK_STOP_RX_ST_CLR_M  (SOC_ETM_I2S2_TASK_STOP_RX_ST_CLR_V << SOC_ETM_I2S2_TASK_STOP_RX_ST_CLR_S)
#define SOC_ETM_I2S2_TASK_STOP_RX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S2_TASK_STOP_RX_ST_CLR_S  16
/** SOC_ETM_I2S2_TASK_STOP_TX_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear I2S2_task_stop_tx trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S2_TASK_STOP_TX_ST_CLR    (BIT(17))
#define SOC_ETM_I2S2_TASK_STOP_TX_ST_CLR_M  (SOC_ETM_I2S2_TASK_STOP_TX_ST_CLR_V << SOC_ETM_I2S2_TASK_STOP_TX_ST_CLR_S)
#define SOC_ETM_I2S2_TASK_STOP_TX_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S2_TASK_STOP_TX_ST_CLR_S  17
/** SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear ULP_task_wakeup_cpu trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR    (BIT(18))
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_M  (SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_V << SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_S)
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_V  0x00000001U
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_CLR_S  18
/** SOC_ETM_ULP_TASK_INT_CPU_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear ULP_task_int_cpu trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR    (BIT(19))
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_M  (SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_V << SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_S)
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_V  0x00000001U
#define SOC_ETM_ULP_TASK_INT_CPU_ST_CLR_S  19
/** SOC_ETM_RTC_TASK_START_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear RTC_task_start trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_START_ST_CLR    (BIT(20))
#define SOC_ETM_RTC_TASK_START_ST_CLR_M  (SOC_ETM_RTC_TASK_START_ST_CLR_V << SOC_ETM_RTC_TASK_START_ST_CLR_S)
#define SOC_ETM_RTC_TASK_START_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_START_ST_CLR_S  20
/** SOC_ETM_RTC_TASK_STOP_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear RTC_task_stop trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_STOP_ST_CLR    (BIT(21))
#define SOC_ETM_RTC_TASK_STOP_ST_CLR_M  (SOC_ETM_RTC_TASK_STOP_ST_CLR_V << SOC_ETM_RTC_TASK_STOP_ST_CLR_S)
#define SOC_ETM_RTC_TASK_STOP_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_STOP_ST_CLR_S  21
/** SOC_ETM_RTC_TASK_CLR_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear RTC_task_clr trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_CLR_ST_CLR    (BIT(22))
#define SOC_ETM_RTC_TASK_CLR_ST_CLR_M  (SOC_ETM_RTC_TASK_CLR_ST_CLR_V << SOC_ETM_RTC_TASK_CLR_ST_CLR_S)
#define SOC_ETM_RTC_TASK_CLR_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_CLR_ST_CLR_S  22
/** SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear RTC_task_triggerflw trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR    (BIT(23))
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_M  (SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_V << SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_S)
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_CLR_S  23
/** SOC_ETM_PDMA_AHB_TASK_IN_START_CH0_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_in_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH0_ST_CLR    (BIT(24))
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_S  24
/** SOC_ETM_PDMA_AHB_TASK_IN_START_CH1_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_in_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH1_ST_CLR    (BIT(25))
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_S  25
/** SOC_ETM_PDMA_AHB_TASK_IN_START_CH2_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_in_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH2_ST_CLR    (BIT(26))
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH2_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_IN_START_CH2_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_IN_START_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_IN_START_CH2_ST_CLR_S  26
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR    (BIT(27))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_S  27
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR    (BIT(28))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_S  28
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR    (BIT(29))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_S  29
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_in_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR    (BIT(30))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_S  30
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_in_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR    (BIT(31))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_S  31

/** SOC_ETM_TASK_ST6_REG register
 *  Tasks trigger status register
 */
#define SOC_ETM_TASK_ST6_REG (DR_REG_SOC_ETM_BASE + 0x218)
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents PDMA_AXI_task_in_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST    (BIT(0))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_S  0
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents PDMA_AXI_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST    (BIT(1))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_S  1
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents PDMA_AXI_task_out_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST    (BIT(2))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_S  2
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents PDMA_AXI_task_out_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST    (BIT(3))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_S  3
/** SOC_ETM_PMU_TASK_SLEEP_REQ_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents PMU_task_sleep_req trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST    (BIT(4))
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_M  (SOC_ETM_PMU_TASK_SLEEP_REQ_ST_V << SOC_ETM_PMU_TASK_SLEEP_REQ_ST_S)
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_V  0x00000001U
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_S  4
/** SOC_ETM_DMA2D_TASK_IN_START_CH0_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents DMA2D_task_in_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST    (BIT(5))
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_M  (SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_V << SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_S  5
/** SOC_ETM_DMA2D_TASK_IN_START_CH1_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents DMA2D_task_in_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST    (BIT(6))
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_M  (SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_V << SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_S  6
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents DMA2D_task_in_dscr_ready_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST    (BIT(7))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_S  7
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents DMA2D_task_in_dscr_ready_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST    (BIT(8))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_S  8
/** SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents DMA2D_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST    (BIT(9))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_V << SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_S  9
/** SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents DMA2D_task_out_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST    (BIT(10))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_V << SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_S  10
/** SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents DMA2D_task_out_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST    (BIT(11))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_V << SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_S  11
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents DMA2D_task_out_dscr_ready_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST    (BIT(12))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_S  12
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents DMA2D_task_out_dscr_ready_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST    (BIT(13))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_S  13
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents DMA2D_task_out_dscr_ready_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST    (BIT(14))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_S  14

