espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST6_CLR_REG register
 *  Tasks trigger status clear register
 */
#define SOC_ETM_TASK_ST6_CLR_REG (DR_REG_SOC_ETM_BASE + 0x21c)
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_in_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR    (BIT(0))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_S  0
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR    (BIT(1))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_S  1
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR    (BIT(2))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_S  2
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_out_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR    (BIT(3))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_S  3
/** SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear PMU_task_sleep_req trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR    (BIT(4))
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_M  (SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_V << SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_S)
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_V  0x00000001U
#define SOC_ETM_PMU_TASK_SLEEP_REQ_ST_CLR_S  4
/** SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR    (BIT(5))
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_S  5
/** SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR    (BIT(6))
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_S  6
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR    (BIT(7))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_S  7
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR    (BIT(8))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_S  8
/** SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR    (BIT(9))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_S  9
/** SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR    (BIT(10))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_S  10
/** SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR    (BIT(11))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_S  11
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR    (BIT(12))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_S  12
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR    (BIT(13))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_S  13
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR    (BIT(14))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_S  14

/** SOC_ETM_CLK_EN_REG register
 *  ETM clock enable register
 */
#define SOC_ETM_CLK_EN_REG (DR_REG_SOC_ETM_BASE + 0x220)
/** SOC_ETM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to open register clock gate.
 *  0: Open the clock gate only when application writes registers
 *  1: Force open the clock gate for register
 */
#define SOC_ETM_CLK_EN    (BIT(0))
#define SOC_ETM_CLK_EN_M  (SOC_ETM_CLK_EN_V << SOC_ETM_CLK_EN_S)
#define SOC_ETM_CLK_EN_V  0x00000001U
#define SOC_ETM_CLK_EN_S  0

/** SOC_ETM_DATE_REG register
 *  ETM date register
 */
#define SOC_ETM_DATE_REG (DR_REG_SOC_ETM_BASE + 0x224)
/** SOC_ETM_DATE : R/W; bitpos: [27:0]; default: 36712497;
 *  Configures the version.
 */
#define SOC_ETM_DATE    0x0FFFFFFFU
#define SOC_ETM_DATE_M  (SOC_ETM_DATE_V << SOC_ETM_DATE_S)
#define SOC_ETM_DATE_V  0x0FFFFFFFU
#define SOC_ETM_DATE_S  0

#ifdef __cplusplus
}
#endif
